# Datumfuncties

In [2]:
%LOAD ../data/employees.db

## Datum en tijd in SQLite

De datum- en tijdfuncties in SQLite wijken nogal af van die in (My)SQL.
Een uitgebreide beschrijving vind je bijvoorbeeld hier:

* https://www.sqlite.org/lang_datefunc.html
* https://www.sqlitetutorial.net/sqlite-date-functions/sqlite-date-function/

We geven hieronder een aantal voorbeelden van veelvoorkomende gevallen.

De basisfuncties voor datum en tijd in TEXT-formaat (ISO-8601) zijn:

* DATE - geeft de datum (als TEXT)
* TIME - geeft de tijd, zonder datum (als TEXT)
* DATETIME - geeft de combinatie van datum en tijd (als TEXT)

Met deze functies kun je via "modifiers" ook rekenen met tijd, bijvoorbeeld 30 dagen verder, 2 maanden eerder, enzovoorts.

### Datum en tijd als getal

De volgende functies geven de datum/tijd als getal: daarmee kun je eenvoudig rekenen, als het om dagen of seconden gaat:

* JULIANDAY - geeft de datum/tijd als getal (aantal dagen sinds 12:00 uur op 24 november 4714 B.C.)
    * zie: https://nl.wikipedia.org/wiki/Juliaanse_dag
* UNIXEPOCH - geeft de datum/tijd als getal (Unix timestamp: seconden sinds 1 jan 1970)

Deze getallen kun je omzetten in (ISO) TEXT-formaat met de eerder genoemde DATE/TIME/DATETIME functies.

In [7]:
SELECT DATE('now');

+-------------+
| DATE('now') |
+-------------+
| 2023-07-05  |
+-------------+

In [26]:
SELECT DATE ('now', 'start of year');

+-------------------------------+
| DATE ('now', 'start of year') |
+-------------------------------+
| 2023-01-01                    |
+-------------------------------+

In [11]:
SELECT TIME ('now');

+--------------+
| TIME ('now') |
+--------------+
| 07:46:02     |
+--------------+

In [24]:
SELECT DATETIME('now', "+10 days")

+-----------------------------+
| DATETIME('now', "+10 days") |
+-----------------------------+
| 2023-07-28 17:22:49         |
+-----------------------------+

In [25]:
SELECT JULIANDAY('now', "-1 month");

+------------------------------+
| JULIANDAY('now', "-1 month") |
+------------------------------+
| 2460114.22443712             |
+------------------------------+

In [27]:
SELECT UNIXEPOCH('now');

+------------------+
| UNIXEPOCH('now') |
+------------------+
| 1689701484       |
+------------------+

Omzetten van unix tijd (getal) naar ISO TEXT waarde:

In [19]:
SELECT DATETIME(UNIXEPOCH('now'), 'unixepoch');

+-----------------------------------------+
| DATETIME(UNIXEPOCH('now'), 'unixepoch') |
+-----------------------------------------+
| 2023-07-18 16:57:58                     |
+-----------------------------------------+

Idem, voor Juliaanse tijd (getal):

In [20]:
SELECT DATETIME(JULIANDAY('now'));

+----------------------------+
| DATETIME(JULIANDAY('now')) |
+----------------------------+
| 2023-07-18 16:58:00        |
+----------------------------+

### strftime

Met de functie `strftime(format, datetime)` kun je het TEXT-formaat van de datum/tijd aanpassen, bijvoorbeeld om een onderdeel te selecteren (zoals "dag", "maand", "jaar").

**Dag. **Met het format `%d` krijg je het nummer van de dag in de maand van een datum:

In [6]:
SELECT last_name, hire_date, strftime('%d', hire_date) as day
FROM employees
WHERE last_name = 'King';

+-----------+------------+-----+
| last_name | hire_date  | day |
+-----------+------------+-----+
| King      | 1987-06-17 | 17  |
+-----------+------------+-----+

**Weekdag.** Als je de dag in de week wilt (met zondag = 0), gebruik je `%w`:

In [22]:
SELECT last_name, hire_date, strftime('%w', hire_date) as day_in_week
FROM employees
WHERE last_name = 'King';

+-----------+------------+-------------+
| last_name | hire_date  | day_in_week |
+-----------+------------+-------------+
| King      | 1987-06-17 | 3           |
+-----------+------------+-------------+

**Maand.** Met het format `%m` haal je het nummer van de maand op van een datum.

In [10]:
SELECT last_name, hire_date, strftime('%m', hire_date) as month
FROM employees
WHERE last_name = 'King';

+-----------+------------+-------+
| last_name | hire_date  | month |
+-----------+------------+-------+
| King      | 1987-06-17 | 06    |
+-----------+------------+-------+

**Jaar.** Met het format `%Y` YEAR haal je het jaar op van een datum.

In [13]:
SELECT last_name, hire_date, strftime('%Y', hire_date) as year
FROM employees
WHERE last_name = 'King';

+-----------+------------+------+
| last_name | hire_date  | year |
+-----------+------------+------+
| King      | 1987-06-17 | 1987 |
+-----------+------------+------+

**Opmerking.** SQLite heeft geen mogelijkheid om maanden of weekdagen te benoemen. Als dat nodig is, kun je de getallen via een `CASE` constructie omzetten in de gewenste namen.

## SQL datum- en tijdfuncties

Het rekenen met datums en tijden in SQL is vrij complex, met aparte "INTERVAL" waarden.
Er zijn ontzettend veel mogelijkheden met datumfuncties. Een overzicht vind je hier:

https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html

Hieronder geven we de MySQL voorbeelden.

### Sysdate

Met `SYSDATE()` haal je de systeemdatum op, de datum van vandaag. Hetzelfde bereik je min of meer met `NOW()`, `LOCALTIME` of `LOCALTIMESTAMP`. Er zijn subtiele verschillen.

 
```SQL
SELECT SYSDATE(), NOW(), LOCALTIME, LOCALTIMESTAMP;
```

![](figs/clip0104.png)

### Day

Met `DAY()` haal je het nummer van de dag op van een datum.

```SQL
SELECT last_name, hire_date, DAY(hire_date)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0095.png)

Als je de naam van de dag wil, dan gebruik je `DAYNAME()`.

```SQL
SELECT last_name, hire_date, DAYNAME(hire_date)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0099.png)

### Month

Met `MONTH()` haal je het nummer van de maand op van een datum.

```SQL
SELECT last_name, hire_date, MONTH(hire_date)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0096.png)

Als je de naam van de maand wil, dan gebruik je MONTHNAME.

```SQL
SELECT last_name, hire_date, MONTHNAME(hire_date)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0098.png)

### Year

Met `YEAR()` haal je het jaar op van een datum.

```SQL
SELECT last_name, hire_date, YEAR(hire_date)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0097.png)

Op deze manier kun je datums van elkaar aftrekken. Bij jaren wordt dan de uitkomst naar beneden afgerond.

```SQL
SELECT last_name, YEAR(hire_date), YEAR(NOW()), YEAR(NOW())-YEAR(hire_date) AS dienstjaren
FROM employees
WHERE last_name = 'King';
```
 

![](figs/clip0105.png)

### Date_add

Met `DATE_ADD` kun je dagen, maanden of jaren toevoegen aan een datum. Met `INTERVAL` geef je aan wat en hoeveel je wil toevoegen. In onderstaande voorbeelden wordt achtereenvolgens 6 dagen, 6 maanden en 6 jaar toegevoegd aan de hire_date.

```SQL
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 DAY)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0101.png)

```SQL
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 MONTH)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0100.png)

```SQL
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 YEAR)
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0102.png)

### Timestampdiff

Met `TIMESTAMPDIFF()` kun je het verschil tussen twee datums uitrekenen, bijvoorbeeld in jaren of maanden.

```SQL
SELECT last_name, hire_date, TIMESTAMPDIFF(YEAR, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';
``` 

![](figs/clip0106.png)

```SQL
SELECT last_name, hire_date, TIMESTAMPDIFF(MONTH, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0107.png)

### Date_format

Datumvelden kun je op allerlei mogelijke manieren vormgeven met `DATE_FORMAT()`. Een overzicht van alle mogelijkheden vind je hier:

https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html#function_date-format

```SQL
SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0103.png)

Als je de uitvoer in het Nederlands wil, dan kun je met een `SET` de local time name op Nederlands zetten. In dit voorbeeld zie je dan *juni* in het Nederlands in plaats van *June* in het Engels. Let op dat er op het eind van de `SET` een puntkomma staat! Het zijn dus eigenljk twee commando's achter elkaar. Je kunt de SET regel ook los invoeren en dan werkt de instelling zolang je in dezelfde sessie bent. Als je de beheerder zou zijn van de database, dan kun je deze SET vastleggen zodat je altijd de uitvoer in het Nederlands hebt.

```SQL
SET lc_time_names = 'nl_NL';

SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';
```

![](figs/clip0109.png)

```SQL
SELECT SYSDATE(), NOW(), LOCALTIME, LOCALTIMESTAMP;
```

In [7]:
SELECT DATE('now');

+-------------+
| DATE('now') |
+-------------+
| 2023-07-05  |
+-------------+

In [11]:
SELECT TIME ('now');

+--------------+
| TIME ('now') |
+--------------+
| 07:46:02     |
+--------------+

In [12]:
SELECT DATETIME('now')

+---------------------+
| DATETIME('now')     |
+---------------------+
| 2023-07-05 07:48:16 |
+---------------------+

In [15]:
SELECT JULIANDAY('now');

+------------------+
| JULIANDAY('now') |
+------------------+
| 2460144.13183356 |
+------------------+

In [16]:
SELECT UNIXEPOCH('now');

+------------------+
| UNIXEPOCH('now') |
+------------------+
| 1689699357       |
+------------------+

In [19]:
SELECT DATETIME(UNIXEPOCH('now'), 'unixepoch');

+-----------------------------------------+
| DATETIME(UNIXEPOCH('now'), 'unixepoch') |
+-----------------------------------------+
| 2023-07-18 16:57:58                     |
+-----------------------------------------+

In [20]:
SELECT DATETIME(JULIANDAY('now'));

+----------------------------+
| DATETIME(JULIANDAY('now')) |
+----------------------------+
| 2023-07-18 16:58:00        |
+----------------------------+

## Day

Met het format `%d` krijg je het nummer van de dag van een datum:

In [6]:
SELECT last_name, hire_date, strftime('%d', hire_date) as day
FROM employees
WHERE last_name = 'King';

+-----------+------------+-----+
| last_name | hire_date  | day |
+-----------+------------+-----+
| King      | 1987-06-17 | 17  |
+-----------+------------+-----+

Als je de dag in de week wilt (met zondag = 0), gebruik je `%w`: naam van de dag wil, dan gebruik je DAYNAME.

In [7]:
SELECT last_name, hire_date, strftime('%w', hire_date) as weekday
FROM employees
WHERE last_name = 'King';

+-----------+------------+---------+
| last_name | hire_date  | weekday |
+-----------+------------+---------+
| King      | 1987-06-17 | 3       |
+-----------+------------+---------+

## Month

Met het format `%m` haal je het nummer van de maand op van een datum.

In [10]:
SELECT last_name, hire_date, strftime('%m', hire_date) as month
FROM employees
WHERE last_name = 'King';

+-----------+------------+-------+
| last_name | hire_date  | month |
+-----------+------------+-------+
| King      | 1987-06-17 | 06    |
+-----------+------------+-------+

Als je de naam van de maand wil, dan gebruik je MONTHNAME.

In [16]:
SELECT last_name, hire_date, MONTHNAME(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: MONTHNAME

## Year

Met het format `%Y` YEAR haal je het jaar op van een datum.

In [13]:
SELECT last_name, hire_date, strftime('%Y', hire_date) as year
FROM employees
WHERE last_name = 'King';

+-----------+------------+------+
| last_name | hire_date  | year |
+-----------+------------+------+
| King      | 1987-06-17 | 1987 |
+-----------+------------+------+

Op deze manier kun je datums van elkaar aftrekken. Bij jaren wordt dan de uitkomst naar beneden afgerond.

In [18]:
SELECT last_name, YEAR(hire_date), YEAR(NOW()), YEAR(NOW())-YEAR(hire_date) AS dienstjaren
FROM employees
WHERE last_name = 'King';

Error: no such function: YEAR

## Date_add

Met DATE_ADD kun je dagen, maanden of jaren toevoegen aan een datum. Met INTERVAL geef je aan wat en hoeveel je wil toevoegen. In onderstaande voorbeelden wordt achtereenvolgens 6 dagen, 6 maanden en 6 jaar toegevoegd aan de hire_date.

In [19]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 DAY)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

In [20]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 MONTH)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

In [21]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 YEAR)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

## Timestampdiff

Met TIMESTAMPDIFF kun je het verschil tussen twee datums uitrekenen, bijvoorbeeld in jaren of maanden.

In [22]:
SELECT last_name, hire_date, TIMESTAMPDIFF(YEAR, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';

Error: no such column: YEAR

In [23]:
SELECT last_name, hire_date, TIMESTAMPDIFF(MONTH, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';

Error: no such column: MONTH

## Date_format

Datumvelden kun je op allerlei mogelijke manieren vormgeven met DATE_FORMAT. Een overzicht van alle mogelijkheden vind je hier:

https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html#function_date-format

In [24]:
SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';

Error: no such function: DATE_FORMAT

Als je de uitvoer in het Nederlands wil, dan kun je met een SET de local time name op Nederlands zetten. In dit voorbeeld zie je dan juni in het Nederlands in plaats van June in het Engels. Let op dat er op het eind van de SET een puntkomma staat! Het zijn dus eigenljk twee commando's achter elkaar. Je kunt de SET regel ook los invoeren en dan werkt de instelling zolang je in dezelfde sessie bent. Als je de beheerder zou zijn van de database, dan kun je deze SET vastleggen zodat je altijd de uitvoer in het Nederlands hebt.

In [25]:
SET lc_time_names = 'nl_NL';

SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';

Error: near "SET": syntax error

In [29]:
SELECT DATE_ADD(DATE('now'), INTERVAL '30' DAY');

Error: near "'30'": syntax error

In [28]:
SELECT DATE('now', '+30 day');

+------------------------+
| DATE('now', '+30 day') |
+------------------------+
| 2023-08-04             |
+------------------------+